colors = {
    "black": {
        "MainWindow": {
            "background-color": "rgba(56, 56, 56, 1)",  # Основной фон
            "Header": {
                "search": {
                    "background": "rgba(121, 121, 121, 1)",  # Строка поиска (фон)
                    "text": "rgba(255, 255, 255, 0.5)",  # Строка поиска (текст)
                },
                "theme": {
                    "widget_background": "rgba(10, 10, 10, 0.4)",  # Изменение темы (фон фрейма)
                    "slider_handle": "rgba(170, 170, 170, 1)"  # Изменение темы (ручка)
                }
            },
            "Main": {
                "musics_list": {
                    "scroll_background": "rgba(217, 217, 217, 0.2)",  # Полоса прокрутки списка треков (фон)
                    "scroll_handle": "rgba(217, 217, 217, 0.5)",  # Полоса прокрутки списка треков (ручка)
                    "widget": "rgba(217, 217, 217, 0.2)",  # Список треков (фон)
                    "music": {
                        "background": "rgba(143, 167, 154, 0.63)",  # Трек (фон)
                        "foto": "rgba(129, 188, 160, 1)",  # Фото трека (фон)
                        "name_text": "rgba(0, 0, 0, 0.62)",  # Название трека (текст)
                        "author_text": "rgba(0, 0, 0, 0.55)",  # Автор трека (текст)
                        "duration_text": "rgba(0, 0, 0, 0.62)"  # Продолжительность трека (текст)
                    }
                },
                "button": {
                    "hover_background": "rgba(129, 188, 160, 1)"  # Кнопки добавления (фон при наведении)
                },
                "playlists": {
                    "scroll_background": "rgba(217, 217, 217, 0.2)",  # Полоса прокрутки списка треков (фон)
                    "scroll_handle": "rgba(217, 217, 217, 0.5)",  # Полоса прокрутки списка треков (ручка)
                    "widget": "rgba(217, 217, 217, 0.2)",  # Список треков (фон)
                    "playlist": {
                        "background": "rgba(143, 167, 154, 0.63)",  # Плейлист (фон)
                        "foto": "rgba(129, 188, 160, 1)",  # Фото плейлиста (фон)
                        "name_text": "rgba(0, 0, 0, 0.62)",  # Название плейлиста (текст)
                        "count_text": "rgba(0, 0, 0, 0.55)"  # Количество треков (текст)
                    }
                }
            },
            "Footer": {
                "background": "rgba(217, 217, 217, 0.2)",  # Полоса трека
                "volume": {
                    "slider_handle": "rgb(217, 217, 217)",  # Ручка полосы громкости
                    "slider_add-page": "rgba(255, 255, 255, 0.6)",  # Полоса громкости после ручки (фон)
                    "slider_sub-page": "rgba(143, 167, 154, 1)"  # Полоса громкости до ручки (фон)
                },
                "main_buttons_pressed": "rgba(129, 188, 160, 1)",  # Основные кнопки (фон при нажатии)
                "second_buttons_hover": "rgba(129, 188, 160, 1)",  # Остальные кнопки (фон при наведении)
                "foto_background": "rgba(129, 188, 160, 1)",  # Фото трека (фон)
                "name_text": "rgba(0, 0, 0, 0.62)",  # Название трека (текст)
                "author_text": "rgba(0, 0, 0, 0.55)",  # Автор трека (текст)
                "time_color": "rgba(0, 0, 0, 0.55)",  # Время трека (текст)
                "slider": {
                    "handle": "rgb(217, 217, 217)",  # Ручка полосы песни
                    "add-page_background": "rgba(255, 255, 255, 0.6)",  # Полоса песни после ручки (фон)
                    "sub-page_background": "rgba(143, 167, 154, 1)"  # Полоса песни до ручки (фон)
                },
            }
        },
        "ErrorWindow": {
            "background": "rgba(56, 56, 56, 1)",  # Фон
            "message": {
                "background": "rgba(56, 56, 56, 1)",  # Фон текста
                "text_color": "rgba(0, 0, 0, 0.62)"  # Цвет текста ошибки
            }
        },
        "AddPlaylistWindow": {
            "background": "rgba(66, 66, 66, 1)",  # Фон
            "foto_background": "rgba(129, 188, 160, 1)",  # Фото (фон)
            "name": {
                "background": "rgba(217, 217, 217, 0.2)",  # Название (фон)
                "text_color": "rgba(0, 0, 0, 0.62)"  # Цвет текста
            },
            "buttons_text": "rgba(0, 0, 0, 0.62)"  # Цвет текста кнопок
        }
    },
    "white": {
        "MainWindow": {
            "background-color": "rgba(177, 185, 197, 1)",  # Основной фон
            "Header": {
                "search": {
                    "background": "rgba(143, 145, 167, 0.5)",  # Строка поиска (фон)
                    "text": "rgba(0, 0, 0, 0.5)",  # Строка поиска (текст)
                },
                "theme": {
                    "widget_background": "rgba(143, 145, 167, 0.5)",  # Изменение темы (фон фрейма)
                    "slider_handle": "rgba(143, 145, 167, 1)"  # Изменение темы (ручка)
                }
            },
            "Main": {
                "musics_list": {
                    "scroll_background": "rgba(217, 217, 217, 0.3)",  # Полоса прокрутки списка треков (фон)
                    "scroll_handle": "rgba(217, 217, 217, 0.5)",  # Полоса прокрутки списка треков (ручка)
                    "widget": "rgba(217, 217, 217, 0.3)",  # Список треков (фон)
                    "music": {
                        "background": "rgba(143, 145, 167, 0.63)",  # Трек (фон)
                        "foto": "rgba(143, 145, 167, 1)",  # Фото трека (фон)
                        "name_text": "rgba(0, 0, 0, 0.62)",  # Название трека (текст)
                        "author_text": "rgba(0, 0, 0, 0.55)",  # Автор трека (текст)
                        "duration_text": "rgba(0, 0, 0, 0.62)"  # Продолжительность трека (текст)
                    }
                },
                "button": {
                    "hover_background": "rgba(143, 145, 167, 1)"  # Кнопки добавления (фон при наведении)
                },
                "playlists": {
                    "scroll_background": "rgba(217, 217, 217, 0.3)",  # Полоса прокрутки списка треков (фон)
                    "scroll_handle": "rgba(217, 217, 217, 0.5)",  # Полоса прокрутки списка треков (ручка)
                    "widget": "rgba(217, 217, 217, 0.3)",  # Список треков (фон)
                    "playlist": {
                        "background": "rgba(143, 145, 167, 0.63)",  # Плейлист (фон)
                        "foto": "rgba(143, 145, 167, 1)",  # Фото плейлиста (фон)
                        "name_text": "rgba(0, 0, 0, 0.62)",  # Название плейлиста (текст)
                        "count_text": "rgba(0, 0, 0, 0.55)"  # Количество треков (текст)
                    }
                }
            },
            "Footer": {
                "background": "rgba(217, 217, 217, 0.3)",  # Полоса трека
                "volume": {
                    "slider_handle": "rgba(217, 217, 217, 1)",  # Ручка полосы громкости
                    "slider_add-page": "rgba(0, 0, 0, 0.2)",  # Полоса громкости после ручки (фон)
                    "slider_sub-page": "rgba(143, 145, 167, 1)"  # Полоса громкости до ручки (фон)
                },
                "main_buttons_pressed": "rgba(143, 145, 167, 1)",  # Основные кнопки (фон при нажатии)
                "second_buttons_hover": "rgba(143, 145, 167, 1)",  # Остальные кнопки (фон при наведении)
                "foto_background": "rgba(143, 145, 167, 1)",  # Фото трека (фон)
                "name_text": "rgba(0, 0, 0, 0.62)",  # Название трека (текст)
                "author_text": "rgba(0, 0, 0, 0.55)",  # Автор трека (текст)
                "time_color": "rgba(0, 0, 0, 0.55)",  # Время трека (текст)
                "slider": {
                    "handle": "rgb(217, 217, 217)",  # Ручка полосы песни
                    "add-page_background": "rgba(0, 0, 0, 0.2)",  # Полоса песни после ручки (фон)
                    "sub-page_background": "rgba(143, 145, 167, 1)"  # Полоса песни до ручки (фон)
                },
            }
        },
        "ErrorWindow": {
            "background": "rgba(200, 200, 200)",  # Фон
            "message": {
                "background": "rgba(200, 200, 200)",  # Фон текста
                "text_color": "rgba(0, 0, 0, 0.62)"  # Цвет текста ошибки
            }
        },
        "AddPlaylistWindow": {
            "background": "rgba(200, 200, 200)",  # Фон
            "foto_background": "rgba(143, 145, 167, 1)",  # Фото (фон)
            "name": {
                "background": "rgba(217, 217, 217, 0.3)",  # Название (фон)
                "text_color": "rgba(0, 0, 0, 0.62)"  # Цвет текста
            },
            "buttons_text": "rgba(0, 0, 0, 0.62)"  # Цвет текста кнопок
        }
    }
}
